<b> Creating Dataframe from a dictionary </b>

In [2]:
import pandas as pd

In [1]:
l1 = {
    'a':[1,2,3],
    'b':[4,5,6],
    'c':[7,8,9]
}

In [11]:
df1 = pd.DataFrame(l1)
df1

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [10]:
df1 = pd.DataFrame(l1,columns=['a','b'],index=[5,6,7])
df1

   a  b
5  1  4
6  2  5
7  3  6

<b>Creating Dataframe from a list</b>

In [12]:
l2 = [[1,2,3],[4,5,6],[6,7,8]]

In [21]:
df2 = pd.DataFrame(l2)
df2

   0  1  2
0  1  2  3
1  4  5  6
2  6  7  8

In [16]:
df2 = pd.DataFrame(l2)
df2.columns = ['a','b','c']
df2

   a  b  c
0  1  2  3
1  4  5  6
2  6  7  8

<b>Creating a series</b>

In [23]:
l3 = [1,2,3]

In [32]:
l4 = pd.Series(l3)
l4

0    1
1    2
2    3
dtype: int64

In [30]:
pd.Series(l3,index=['a','b','c'], name='sumit',dtype='double')

a    1.0
b    2.0
c    3.0
Name: sumit, dtype: float64

<b> Creating a dataframe from a series</b>

In [39]:
df3 = pd.DataFrame(l4,columns=['a'],index=[0,1])

In [40]:
df3

   a
0  1
1  2

In [55]:
l5 = pd.Series(['p','q','r'])
l5

0    p
1    q
2    r
dtype: object

In [56]:
df4 = pd.DataFrame(l5 )
df4

   0
0  p
1  q
2  r

In [57]:
l1 = {
    'a':[1,2,3],
    'b':[4,5,6],
    'c':[7,8,9]
}

In [65]:
df1 = pd.DataFrame(l1)
df1

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [67]:
pd.options.display.max_rows = 70

In [68]:
pd.options.display.max_rows

70

In [69]:
l6 =[
    {
        'a':[1,2,3],
        'b':[4,5,6],
        'c':[7,8,9]
    },
    {
        'p':[1,2,3],
        'q':[4,5,6],
        'r':[7,8,9]
    }  
]

In [75]:
df6 = pd.DataFrame(l6)
df6

           a          b          c          p          q          r
0  [1, 2, 3]  [4, 5, 6]  [7, 8, 9]        NaN        NaN        NaN
1        NaN        NaN        NaN  [1, 2, 3]  [4, 5, 6]  [7, 8, 9]

In [76]:
# importing pandas library from 
# python
import pandas as pd

# Creating an array of names
arrays = ['Sohom','Suresh','kumkum','subrata']

# Creating an array of ages
age= [10, 11, 12, 13]

# Creating an array of marks
marks=[90,92,23,64]

# Using MultiIndex.from_arrays, we are
# combining the arrays together along 
# with their names and creating multi-index 
# with each element from the 3 arrays into
# different rows
pd.MultiIndex.from_arrays([arrays,age,marks], names=('names', 'age','marks'))

MultiIndex([(  'Sohom', 10, 90),
            ( 'Suresh', 11, 92),
            ( 'kumkum', 12, 23),
            ('subrata', 13, 64)],
           names=['names', 'age', 'marks'])